Title: 'Seal the Rift Gate'

1. Introduction to Protagonist: You, the Time Seeker, is caught in a never-ending war between two feuding kingdoms, Ealdora and Keldrion. The Ealdorians are known for their tranquility and connection with nature, while the Keldrions are known for their industrial prowess and strategic brilliance.
   
2. Rift Gate Introduction: The birth of a mysterious Rift Gate between both kingdoms, spiraling the careful balance out of control, and unleashing havoc in the form of monsters from another realm.

3. Meeting the Harbingers: A secret group named the 'Harbingers' reveals itself to you - they're the guardians of the 'Rift Gate,' and had once sealed a similar Gate centuries ago.
      
4. Harbingers' Challenge: As a trusted, neutral party, you are tasked by the Harbingers to gather seven sacred artefacts spread across both kingdoms to seal the Gate.

5. Protagonist's Quest: Each artefact location forms a fascinating saga, serving to showcase the unique traits of the world and its characters: a hidden Dragon's lair in a forest sanctuary; a haunted library; a drowned underwater city; a desert where time stands still; the unbroken tower at the world's end, etc.

6. Deeper Plot Uncovered: In your journey, you find that the Rift Gate was not a natural phenomenon but a desperate act of King Uldred of Keldrion to gain more power.

7. Keldrion Conflict: This revelation instigates a rebellion in Keldrion, led by the sympathetic General Idris, forcing you to aid in restoring order.

8. Ealdora's Stand: Simultaneously, the kind-hearted Queen Adalia of Ealdora learns of Uldred's deceit and mobilizes her regiments, making you a part of the diplomatic council to prevent a catastrophic full-blown war.
  
9. War Unleashed: Despite the efforts, war erupts, and amid epic battles, you continue your quest to find the remaining artefacts, even dueling with Uldred himself.

10. The Final Seal: Just as the battle reaches its zenith, you acquire the last artefact and seal the Rift Gate.

11. Resolution and Aftermath: The closing of the Gate ceases the monsters' influx, calming the chaos and forcing the warring kingdoms to ceasefire. King Uldred is dethroned, and peace returns under new leadership while you part ways from the now stable kingdoms, the renowned hero of the seals.